[UI_TREE]
Machine = mga setting ng hardware
POWER = Katangian ng supply ng kuryente
TOUCH = Mga setting ng pedal

[IPG,CO2]
MPULSE_FREQ = pagpapanatili ng dalas ng pulso (kHz)
MPULSE_RELS = oras ng paglabas ng pagpapanatili (US)

[IPG]
MO_DELAY_STEPS = MO delay (sa amin)
MODECHG_DELAY= Mode paglipat pagkaantala (ms)

[YAG,DP,EP,LD]
WORK_CURRENT_TYPE = Ipasok ang dialog box na may kasalukuyang halaga
WORK_CURRENT_TYPEOption = Layer 0 Kasalukuyang|Setpoint
WORK_CURRENT= Itakda ang operating current (A)

[ALL]
SAFE_DOOR = proteksyon ng safety gate
SAFE_DOOROption=invalid|pause|abort
MARKEND_SCAN = Markahan ang posisyon ng end galvanometer
MARKEND_SCANOption= Pinagmulan|Itaas kaliwa|Tuktok Sentro Posisyon|Tuktok Kanan Gitna|Kanan Gitna|Ibaba Gitna|Ibaba Gitna|Ibaba Sulok|Kaliwang sulok|Kaliwang Gitna|Pasadyang Posisyon
MARKEND_X = Napapasadyang X coordinate (mm)
MARKEND_Y = Napapasadyang Y coordinate (mm)

[SCAN]
PREHEAT_ENABLE = kailangan bang magpainit ng galvanometer
PREHEAT_ENABLEOption=Hindi|Oo
PREHEAT_TIME = Minimum na oras ng pag init (min)
USE_LIMIT_JUMPDELAY=Kung paganahin ang jump delay
USE_LIMIT_JUMPDELAYOption=Hindi|Oo
LIMIT_JUMPLEN= Limitahan ang distansya ng paglukso (mm)
LIMIT_JUMPDELAY_MM = oras ng paglukso sa bawat mm (sa amin)

[BitmapPower]
BitmapPower = grayscale bitmap pagmamarka
AUT_TIME = Oras ng pagkabulok (US)
AUT_COFF = Gain factor (0-1)

[Signal]
Signal = mga setting ng signal
Cycle=Trigger ng ilang beses para maging epektibo
MARK_CNT= Pagmamarka ng mga marka ng utos ng ilang beses sa isang pagkakataon
DELAY = Delay Pagkatapos ng Trigger (ms)
DLY_BETWEEN_MARK = Pagkaantala ng oras sa pagitan ng pagmamarka (ms)
MARK_END_DELAY = Pagkaantala pagkatapos ng pagmamarka ng pagkumpleto (ms)
MARK_END_PULSE_W = Pagmamarka ng Haba ng End Signal (ms)
B_MARK_ONCE= mode ng trigger
B_MARK_ONCEOption = Level trigger|edge trigger
Enable_Loop_Mdt=Paikot na pagmamarka pagkatapos ng offline
Enable_Loop_MdtOption=Huwag paganahin|Paganahin
IOSELCOUNT = Bilang ng I / O piliin ang mga signal ng dokumento
ENABLE_CARDTOUCH = Mas mababang computer trigger
ENABLE_CARDTOUCHOption = Huwag paganahin|Paganahin

[UI_FACE]
ExportSysPara = Export parameter...
ImportSysPara = import parameter...
Ok = OK
Cancel= Kanselahin
Apply =Mag-apply

;---------------------------------BEGIN: EMCC\HansLaserSet.dll-----------------------------------------
[DIALOG_LASERSET]

0=Laser hardware parameter na setting Wizard

1=Nakaraang hakbang

2=Sa susunod na

3=I-Save ang

4=Kanselahin


[DIALOG_POWER]

0=Ikalawang hakbang: i-set up ang iyong napiling laser configuration ng hardware

1=Kasalukuyang pagsasaayos ng mga hanay(Isang)

2=Minimum na kasalukuyang(%):

3=Maximum na kasalukuyang(A):

4=AnalogQDrive

5=DigitalQDrive

6=QDrive type

7=Power supply ng uri

8=CO2Laser kapangyarihan laki

9=Ordinaryong kapangyarihan

10=Mabilis na tugon ng kapangyarihan supply ng

11=Mas malaki kaysa sa o katumbas ng100W

12=Mas mababa kaysa sa100W

13=Ang mga sang-ayunan ang pulso ng mga setting ng

14=Dalas(KHZ)

15=Oras ng paglabas(sa amin)

16=IDle kasalukuyang(%):

17=Maximum na ikot ng tungkulin

18=Kabayaran kasalukuyang（%）

19=Laser hardware set

20=MItakda ang halaga ng mga

21=MHalaga:

22=Salik ng pagsasaayos ng:

23=Normal

24=Masyadong malaki

25=Masyadong maliit


[DIALOG_MODEL]

0=Ika-apat na hakbang: ayon sa iyong gusto mo, piliin ang iyong mga Paboritong control mode

1=Isang bagong paraan upang kontrolin, simpleng operasyon, ang mga gumagamit ay hindi kailangan upang itakda ang anumang mga pagkaantala,Ngunit lamang sa mga bahagi ng laser na ginagamit.

2=Tradisyonal na laser kontrol mode, sa linya sa karamihan ng mga tao gamitin ang mga gawi, ang lahat ng laser na maaaring magamit sa ganitong paraan.

3=Madaling mode

4=Tradisyonal na mode

5=Laser pagmamarka control mode

6=Square head uri

7=Solong-ulo mode

8=Dalawahan-mode ng ulo


[DIALOG_LaserType]

0=Laser uri:

1=YAGLaser

2=DPLaser

3=UV acrylic laser

4=CO2Laser

5=TonoQFiber laser

6=SPILaser

7=LDLaser

8=YLPM(HFM-H)Laser

9=YLP-V2Laser

10=YLPPLaser

11=HFM-ISANGLaser

12=HFM-PLaser

13=HFM-RLaser

14=HFM-JLaser

15=MOPAMadaling iakma lapad ng pulse ng laser

16=patuloy na laser ng fibra

17=Ultra mabilis na laser


[DIALOG_CONTENT]

0=Ikalimang hakbang: binabati kita sa iyo, ang iyong mga setting ay nai-nakumpleto, mangyaring i-save ang may-katuturang mga parameter


[LaserType_Explain]

0=YAGLaser

1=DPLaser

2=UV acrylic laser

3=CO2Laser

4=TonoQFiber laser

5=SPILaser

6=LDLaser

7=MoPaFiber laser

8=YLP-V2Laser

9=YLPPLaser

10=HFM-ISANGLaser

11=HFM-PLaser

12=HFM-QLaser

13=HFM-JLaser

14=iba pang mga


[Model_Explain]

0=CO2 Madaling mode

1=CO2 Tradisyonal na mode

2= TonoQ, Normal na supply ng kapangyarihan+DigitalQ Tradisyonal na mode

3= TonoQ, Normal na supply ng kapangyarihan+AnalogQ Tradisyonal na mode

4= TonoQ, Mabilis na tugon power supply ng+DigitalQ Tradisyonal na mode

5= TonoQ, Mabilis na tugon power supply ng+AnalogQ Tradisyonal na mode

6= TonoQ, Normal na supply ng kapangyarihan+AnalogQ Madaling mode

7= TonoQ, Mabilis na tugon power supply ng+DigitalQ Madaling mode

8= TonoQ, Mabilis na tugon power supply ng+AnalogQ Madaling mode

9= IPG Mode

10=SPI Madaling mode

11=SPI Tradisyonal na mode

12=LD Mode

13=YLPM(HFM-H) Tradisyonal na mode

14=YLPM(HFM-H) Madaling mode

15=YLP-V2 Tradisyonal na mode

16=YLP-V2 Madaling mode

17=YLPP Tradisyonal na mode

18=YLPP Madaling mode

19=HFM-ISANG Tradisyonal na mode

20=HFM-ISANG Madaling mode

21=HFM-P Tradisyonal na mode

22=HFM-P Madaling mode

23=HFM-R Tradisyonal na mode

24=HFM-R Madaling mode

25=HFM-J Tradisyonal na mode

26=HFM-J Madaling mode


[DIALOG_ScanType]

0=Ikatlong hakbang: Itakda ang uri galbanomiter

1=Gawa sa galbanomiter

2=Iba pang mga galbanomiter

3=Mga tip:Mangyaring piliin ang machine na naaayon sa galbanomiter uri, Gawa sa galbanomiter pagkatapos ng kapangyarihan-sa mainit-init-up upang gumana nang maayos,Iba pang mga galbanomiter nang preheating

;---------------------------------End: EMCC\HansLaserSet.dll-----------------------------------------

;---------------------------------BEGIN: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------
[PORTDIALOGTEXT]
STATIC_0 = Itigil ang machining ng input port
STATIC_1 = Itigil ang machining ng output port
STATIC_2 = Output port
STATIC_3 = Tarangkahan ng Kaligtasan
STATIC_4 = Input port
STATIC_5 = Ang laser ay handa na para sa output
STATIC_6 = Input port
STATIC_7 = Output port
STATIC_8 = Software handa na output
STATIC_9 = port ng output
STATIC_10 = output ng kapangyarihan ng laser
STATIC_11 = pantalan
STATIC_12 = Panlabas na pulang ilaw indikasyon output
STATIC_13 = port ng output
STATIC_14 = Input port
STATIC_15 = Markadong saliw
STATIC_16 = port ng output
STATIC_17 = Katapusan ng pagmamarka ng output
STATIC_18 = port ng output
STATIC_19 = lapad ng pulso
STATIC_20 = hibla laser alarma output
STATIC_21 = Output port
STATIC_22 = Simulan ang pagmamarka sa port
STATIC_23 = Input port
IDC_CHECK_LASERWARN = Pagtukoy laser alarma
IDC_CHECK_PLUSE_REVERSE = Q antas ng signal inversion
IDC_RADIO_NORMAL = Pamantayan
IDC_RADIO_BICOLORLAMP = Dalawang kulay na ilaw
IDC_RADIO_TRICOLORLIGHT = Ilaw ng tricolor

[error]
1=Hindi inisyal ang card o hindi natagpuan ang card!
2 = Nabigo ang pag-reset!
3 = Hindi tama ang bersyon ng card!
4 = Alarm!
6=Nabigo ang pagpapatupad!
7=Hindi tumutugma ang katayuan!
16=Nag-time out ang command!
17=Nawala ang utos!
18=Interface tawag asynchronous!
19=Interface na inookupahan ng ibang programa!
20 = Z axis overrun o pagwawasto ng file katiwalian!
21=Hindi pagkakatugma ng Parameter!
23=Nabigo ang alokasyon ng memorya!
100 = Offline na paggamit!
101=Ipinalaglag ang utos!
1001=Port 1
1002=Port 2
1003=Port 3
1004=Port 4
1005=Port 5
1006=Port 6
1007=Port 7
1008 = Hindi handa ang input ng Laser
1009 = Handa na ang input ng laser


;---------------------------------END: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------

; ---------------------------------BEGIN: EMCC\HansLaserSet. dll\HansLaserSetDlg-----------------------------------------
[TITLESTRING]
IDD_LASERSET_DIALOG= Setting ng Laser
IDD_PROPPAGE_POWER= katangian ng power supply
IDD_PROPPAGE_SYS_SET=Mga setting ng hardware
IDD_PROPPAGE_TOUCH= Mga setting ng pedal
IDD_PORT_SET = Mga setting ng port

[IDD_DIALOG_HANSLASERSET]
CAPTION=System Settings
IDC_BTN_SAVE= Preserve
IDCANCEL= I-quit
LISTTITLE_NAME= Pangalan ng item
LISTTITLE_VALUE= Halaga

; ---------------------------------END: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------
